ХамелионЦРПТ/src/ChartsOfCharacteristicTypes/МВ_ПереченьДополнительныхНастроек/МВ_ПереченьДополнительныхНастроек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>МВ_ПереченьДополнительныхНастроек</name>
  <type>
    <types>Boolean</types>
    <types>CatalogRef.МВ_Интеграторы</types>
    <types>CatalogRef.Пользователи_ХамелеонЦРПТ</types>
    <types>String</types>
    <types>Date</types>
    <types>Number</types>
    <types>CatalogRef.Продукция_ХамелеонЦРПТ</types>
    <types>CatalogRef.Организации_ХамелеонЦРПТ</types>
    <numberQualifiers>
      <precision>15</precision>
      <scale>3</scale>
    </numberQualifiers>
    <stringQualifiers>
      <length>1024</length>
    </stringQualifiers>
  </type>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>КодыМаркировки</name>
      <description>Коды маркировки</description>
    </items>
    <items>
      <name>РаботаСОператоромОКТО</name>
      <description>Работа с оператором ОКТО</description>
    </items>
    <items>
      <name>ИнтеграторНаЛинияхПроизводства</name>
      <description>Интегратор на линиях производства</description>
      <type>
        <types>Boolean</types>
        <types>CatalogRef.МВ_Интеграторы</types>
        <types>CatalogRef.Пользователи_ХамелеонЦРПТ</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>CatalogRef.Продукция_ХамелеонЦРПТ</types>
        <types>CatalogRef.Организации_ХамелеонЦРПТ</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>КаталогЧтенияВСД</name>
      <description>Каталог чтения ВСД</description>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>ОсновнаяОрганизация</name>
      <description>Основная организация</description>
      <type>
        <types>CatalogRef.Организации_ХамелеонЦРПТ</types>
      </type>
    </items>
    <items>
      <name>ОсновнойПоставщик</name>
      <description>Основной поставщик</description>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>ЭтоЦентральнаяБаза</name>
      <description>Это центральная база</description>
      <type>
        <types>Boolean</types>
      </type>
    </items>
  </predefined>
  <attributes>
    <name>Общая</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеПоУмолчанию</name>
    <type>
      <types>Characteristic.МВ_ПереченьДополнительныхНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:ChartOfCharacteristicTypes>

ХамелионЦРПТ/src/ChartsOfCharacteristicTypes/МВ_ПереченьДополнительныхНастроек/ManagerModule.bsl
// ФТО:ALNA 22.07.2019 30701

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗадатьРеквизитыПредопределенныхНастроек(ТолькоИнформация, ВозвращаемыйЗаголовок, ВозвращаемаяВерсия) Экспорт // для вызова из обработки инициализации
	                     
	ВозвращаемаяВерсия = 100;
	ВозвращаемыйЗаголовок = НСтр("ru = 'Заполнение реквизитов настроек'");
	Если ТолькоИнформация Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина); //Нет прав у Полных прав
	ПВХ = ПланыВидовХарактеристик.МВ_ПереченьДополнительныхНастроек;
	ПустаяДата = '00010101000000';
	
	#Область ОбщиеНастройки
//	ЗадатьРеквизитыНастройки(ПВХ.ЭтаИБДляРазработкиИОтладки, Истина, Ложь);
	ЗадатьРеквизитыНастройки(ПВХ.ОсновнаяОрганизация, Истина, Справочники.Организации_ХамелеонЦРПТ.ПустаяСсылка());
	ЗадатьРеквизитыНастройки(ПВХ.ИнтеграторНаЛинияхПроизводства, Истина, Справочники.МВ_Интеграторы.ПустаяСсылка());
	
	//++ ФТО:ALNA 23.08.2019 31369
	ЗадатьРеквизитыНастройки(ПВХ.ЭтоЦентральнаяБаза, Истина, Ложь,, НСтр("ru = 'Определяет, что данная ИБ является центральной.'"));
	//-- ФТО:ALNA 23.08.2019
	
	//++ ФТО:ALNA 02.12.2019 34040
//	ЗадатьРеквизитыНастройки(ПВХ.ПроведениеПоРегиструЗаказыКлиентовДляНастройкиЗаказКакСчет, Истина, Ложь,, НСтр("ru = 'При установке этого признака и настройке ""Заказ как счет"" ""Реализация товаров и услуг"" делает движение по регистру ""Заказы клиента"", а документ ""Заказ клиента"" в статусе ""К отгрузке"" делает движение только по регистру ""Заказы клиента""'"));
//	ЗадатьРеквизитыНастройки(ПВХ.ОтключитьПроведениеЗаказовПоРегиструСвободныеОстатки, Истина, Ложь,, НСтр("ru = 'При установке данной настройки документ ""Заказ на внутреннее потребление"" не делает движения по регистру ""Свободные остатки"".'"));
	//-- ФТО:ALNA 02.12.2019
	
	//++ ФТО:YLYA 04.12.2019 34149
//	ЗадатьРеквизитыНастройки(ПВХ.ОсновнаяКассаОрганизации, Истина, Справочники.Кассы.ПустаяСсылка(),, НСтр("ru = 'В эту кассу поступают наличные денежные средства от клиентов'"));
	//-- ФТО:YLYA 04.12.2019 
	
	//++ ФТО:YLYA 05.02.2020 35608
//	ЗадатьРеквизитыНастройки(ПВХ.ЗаполнятьЧекККМДаннымиИзДокументаПКО, Истина, Ложь,, НСтр("ru = 'При установленном признаке в чек ККМ попадают данные из ТЧ ""Товары"" документа ПКО с учетом возвратов, корректировок и внесенных авансов'"));
	//-- ФТО:YLYA 05.02.2020 
	
	//++ ФТО:DARS 17.02.2020 35985
//	ЗадатьРеквизитыНастройки(ПВХ.ОтражатьЗаказыВМестах, Истина, Ложь,, НСтр("ru = 'Используется в документах ""Заказ на перемещение"" и ""Заказ поставщику"" для определения видимости колонок ""Мест"" и ""Количество""'"));
	//-- ФТО:DARS 17.02.2020
	
	//++ ФТО:GUTA 28.02.2020 35587
	ЗадатьРеквизитыНастройки(ПВХ.КаталогЧтенияВСД, Истина, "",, НСтр("ru = 'Путь к каталогу, из которого выполняется поиск и чтение файлов для формы печати эВСД'"));
	//-- ФТО:GUTA 28.02.2020
	
	//++ ФТО:DARS 03.04.2020 33785
//	ЗадатьРеквизитыНастройки(ПВХ.КоличествоПаллетВЗаказе, Истина, 0, , НСтр("ru = 'Количество паллет в сводном заказе'"));
	//-- ФТО:DARS 03.04.2020
	
	//++ ФТО:DARS 10.06.2020 36995
	//++ ФТО:DARS 23.09.2020 43838
	//ЗадатьРеквизитыНастройки(ПВХ.ИнтервалРасчета, Истина, 0,, НСтр("ru = 'Интервал расчета (тестовое описание)'"));
//	ЗадатьРеквизитыНастройки(ПВХ.ИнтервалРасчета, Истина, 0,, НСтр("ru = 'Период (дней) для отбора документов при формировании сводного заказа'"));	
	//-- ФТО:DARS 23.09.2020
	//-- ФТО:DARS 10.06.2020	
	
	#КонецОбласти
	
	#Область Возвраты
	
	//++ ФТО:DARS 01.03.2021 46277
//	ЗадатьРеквизитыНастройки(ПВХ.ВодителиМолвеста, Истина, Справочники.СегментыПартнеров.ПустаяСсылка());
//	ЗадатьРеквизитыНастройки(ПВХ.СтатьяСписанияНаВодителяМолвеста, Истина, ПланыВидовХарактеристик.СтатьиРасходов.ПустаяСсылка());
	//-- ФТО:DARS 01.03.2021
	//++ ФТО:DARS 01.03.2021 47655
//	ЗадатьРеквизитыНастройки(ПВХ.ПричинаНеотгрузкиСоСклада, Истина, ПланыВидовХарактеристик.СтатьиРасходов.ПустаяСсылка(),, НСтр("ru = 'Указывается причина возврата в случае фактической неотгрузки товаров со склада'"));
	//-- ФТО:DARS 01.03.2021
	
	#КонецОбласти
	
	#Область Дегустации
	//++ ФТО:YLYA 07.10.2019 32311
//	ЗадатьРеквизитыНастройки(ПВХ.ДегустацииПоЛимитам, Истина, Справочники.НаправленияДеятельности.ПустаяСсылка(),, НСтр("ru = 'Это направление деятельности объединяет документы, в которых учитываются товары, переданные клиентам на дегустацию в рамках лимитов'"));
//	ЗадатьРеквизитыНастройки(ПВХ.ДегустацииПоСлужебнымЗапискам, Истина, Справочники.НаправленияДеятельности.ПустаяСсылка(),, НСтр("ru = 'Это направление деятельности объединяет документы, в которых учитываются товары, переданные клиентам на дегустацию по служебным запискам, оформленным на сотрудников'"));
//	ЗадатьРеквизитыНастройки(ПВХ.ПокупательДегустационнойПродукции, Истина, Справочники.Партнеры.ПустаяСсылка(),, НСтр("ru = 'Контрагент, являющийся дистрибьютором АО ""Молвест"", через которого дегустационная продукция попадает конечному клиенту'"));
	//++ ФТО:YLYA 02.07.2020 40774
	//ЗадатьРеквизитыНастройки(ПВХ.СтатьяРасходовДляДегустации, Истина, ПланыВидовХарактеристик.СтатьиРасходов.ПустаяСсылка(),, НСтр("ru = 'Статья расходов, на которую списывается дегустационная продукция'"));
//	ЗадатьРеквизитыНастройки(ПВХ.СтатьяРасходовДляДегустации, Истина, ПланыВидовХарактеристик.СтатьиРасходов.ПустаяСсылка(),, НСтр("ru = 'Эта статья расходов объединяет документы, в которых учитываются товары, переданные клиентам на дегустацию в рамках лимитов торговых представителей'"));
	//-- ФТО:YLYA 02.07.2020 
//	ЗадатьРеквизитыНастройки(ПВХ.СкладДляДегустации, Истина, Справочники.Склады.ПустаяСсылка(),, НСтр("ru = 'Склад, с которого осуществляется отгрузка дегустационной продукции. Значение заполняется в документе ""Заказ на внутреннее потребление"" по умолчанию'"));
//	ЗадатьРеквизитыНастройки(ПВХ.ЦеныДляДегустаций, Истина, Справочники.ВидыЦен.ПустаяСсылка(),, НСтр("ru = 'Вид цены, по которому происходит списание дегустационной продукции'"));
	//-- ФТО:YLYA 07.10.2019 
	
	//++ ФТО:YLYA 25.02.2020 32311
//	ЗадатьРеквизитыНастройки(ПВХ.ГруппаАналитикДляДегустаций, Истина, Справочники.НаправленияДеятельности.ПустаяСсылка(),, НСтр("ru = 'Направления деятельности из этой группы используются для учета различных видов дегустаций'"));
	//-- ФТО:YLYA 25.02.2020 
	
	//++ ФТО:YLYA 26.02.2020 36357
	//ЗадатьРеквизитыНастройки(ПВХ.НомерРаспоряжения, Истина, "",, НСтр("ru = 'Номер документа ""Распоряжение"", используемого в печатной форме акта по проведенной рекламной акции при списании по лимитам ОРП'"));
	//ЗадатьРеквизитыНастройки(ПВХ.ДатаРаспоряжения, Истина, ПустаяДата,, НСтр("ru = 'Дата документа ""Распоряжение"", используемого в печатной форме акта по проведенной рекламной акции при списании по лимитам ОРП'"));
	////-- ФТО:YLYA 26.02.2020 
	//
	////++ ФТО:YLYA 21.03.2020 36642
	//ЗадатьРеквизитыНастройки(ПВХ.ДегустацияБезУчастников, Истина, Справочники.НаправленияДеятельности.ПустаяСсылка(),, НСтр("ru = 'Это направление деятельности объединяет документы, в которых учитываются товары, списанные на дегустацию без указания конкретного партнера, подразделения или представительства'"));
	////-- ФТО:YLYA 21.03.2020 
	//
	////++ ФТО:YLYA 02.07.2020 40774
	//ЗадатьРеквизитыНастройки(ПВХ.ГруппаАналитикДляДегустацийСтатьиРасходов, Истина, ПланыВидовХарактеристик.СтатьиРасходов.ПустаяСсылка(),, НСтр("ru = 'Статьи расходов из этой группы используются для учета различных видов дегустаций'"));
	//ЗадатьРеквизитыНастройки(ПВХ.ГруппаАналитикДляДегустацийБезУчастниковСтатьиРасходов, Истина, ПланыВидовХарактеристик.СтатьиРасходов.ПустаяСсылка(),, НСтр("ru = 'Эти статьи расходов объединяет документы, в которых учитываются товары, списанные на дегустацию без указания конкретного партнера, подразделения или представительства'"));
	////-- ФТО:YLYA 02.07.2020 	
	//
	////++ ФТО:YLYA 05.10.2020 44193
	//ЗадатьРеквизитыНастройки(ПВХ.СкладДляДегустацийОТК, Истина, Справочники.Склады.ПустаяСсылка(),, НСтр("ru = 'Склад, с которого осуществляется отгрузка дегустационной продукции для отдела ОТК. Значение заполняется в документе ""Заказ на внутреннее потребление"" по умолчанию'"));
	//-- ФТО:YLYA 05.10.2020 
	#КонецОбласти

	//#Область Инвентаризация
	////++ ФТО:YLYA 16.04.2020 37873
	//ЗадатьРеквизитыНастройки(ПВХ.СтатьяДляОтраженияИзлишковТоваров, 		 Истина, ПланыВидовХарактеристик.СтатьиДоходов.ПустаяСсылка(),  0, НСтр("ru = 'Статья, по которой документ «Пересчет товаров» будет отражать поступление товаров на склад по результатам инвентаризации'"));
	//ЗадатьРеквизитыНастройки(ПВХ.СтатьяДляОтраженияНедостачТоваров, 		 Истина, ПланыВидовХарактеристик.СтатьиРасходов.ПустаяСсылка(), 0, НСтр("ru = 'Статья, по которой документ «Пересчет товаров» будет отражать недостачи товаров на складе по результатам инвентаризации'"));
	//ЗадатьРеквизитыНастройки(ПВХ.СтатьяДляОтраженияПересортицыТоваровПриход, Истина, ПланыВидовХарактеристик.СтатьиДоходов.ПустаяСсылка(),  0, НСтр("ru = 'Статья, по которой документ «Пересчет товаров» будет отражать поступление товаров на склад по результатам инвентаризации в связи с пересортицей по датам'"));
	//ЗадатьРеквизитыНастройки(ПВХ.СтатьяДляОтраженияПересортицыТоваровРасход, Истина, ПланыВидовХарактеристик.СтатьиРасходов.ПустаяСсылка(), 0, НСтр("ru = 'Статья, по которой документ «Пересчет товаров» будет отражать списание товаров на складе по результатам инвентаризации в связи с пересортицей по датам'"));
	////-- ФТО:YLYA 16.04.2020 
	//#КонецОбласти
	//
	//#Область ЗапросДанныхИзЦербер
	//
	////++ ФТО:DARS 10.03.2021 46134
	//Описание = НСтр("ru = 'Используется для подключения к ""Цербер"" при получении информации о хозяйствующих субъектах/поднадзорных объектах партнеров.'");
	//
	//ЗадатьРеквизитыНастройки(ПВХ.Цербер_АдресОпределенияWebСервиса, Истина, "http://api.vetrf.ru/schema/platform/services/2.1-RC-last/EnterpriseService_v2.1_production.wsdl", 10, Описание);
	//ЗадатьРеквизитыНастройки(ПВХ.Цербер_ЛогинWebСервиса, Истина, "", 20, Описание);
	//ЗадатьРеквизитыНастройки(ПВХ.Цербер_ПарольWebСервиса, Истина, "", 30, Описание);
	////-- ФТО:DARS 10.03.2021
	//
	//#КонецОбласти
	//
	//#Область МежфилиальныеПеремещения
	////++ ФТО:SOAL 19.11.2019 33761
	//ЗадатьРеквизитыНастройки(ПВХ.ОсновнаяОрганизацияПоставщик, 	Истина, Справочники.Организации.ПустаяСсылка(),, НСтр("ru = 'Используется в обработке ""(МВ) Формирование заказов на межфилиальное перемещение"" для автоматического заполнения реквизита ""Организация-отправитель""'"));
	//ЗадатьРеквизитыНастройки(ПВХ.ОтгрузкаЦелымиУпаковками,		Истина, Справочники.Склады.ПустаяСсылка(),, НСтр("ru = 'Указываются склады, для которых необходимо вводить данные о количестве в местах в документах ""Заказ на перемещение""'"));
	//
	////++ ФТО:DARS 04.02.2020 35241
	//// добавлен Тип значения характеристик: Справочник.МВ_ВидыНесоответствий
	////++ ФТО:DANC 08.04.2020 37584
	////ЗадатьРеквизитыНастройки(ПВХ.ВидНесоответствияИзлишки, Истина, Справочники.МВ_ВидыНесоответствий.ПустаяСсылка(),, НСтр("ru = 'Вид несоответствия, который указывается в документе ""Акт о расхождениях после перемещения"" в табличной части ""Товары"", где значение реквизита ""Расхождения"" больше нуля. Используется при автоматическом формировании акта.'"));
	////ЗадатьРеквизитыНастройки(ПВХ.ВидНесоответствияНедостачи, Истина, Справочники.МВ_ВидыНесоответствий.ПустаяСсылка(),, НСтр("ru = 'Вид несоответствия, который указывается в документе ""Акт о расхождениях после перемещения"" в табличной части ""Товары"", где значение реквизита ""Расхождения"" меньше нуля. Используется при автоматическом формировании акта.'"));
	//ЗадатьРеквизитыНастройки(ПВХ.ВидНесоответствияИзлишки, Истина, Справочники.МВ_ВидыНесоответствий.ПустаяСсылка(),, НСтр("ru = 'Вид несоответствия, который указывается в документе ""Факт приемки для перемещения"" в табличной части ""Товары"", где значение реквизита ""Расхождения"" больше нуля. Используется при автоматическом формировании акта.'"));
	//ЗадатьРеквизитыНастройки(ПВХ.ВидНесоответствияНедостачи, Истина, Справочники.МВ_ВидыНесоответствий.ПустаяСсылка(),, НСтр("ru = 'Вид несоответствия, который указывается в документе ""Факт приемки для перемещения"" в табличной части ""Товары"", где значение реквизита ""Расхождения"" меньше нуля. Используется при автоматическом формировании акта.'"));
	////-- ФТО:DANC 08.04.2020
	////-- ФТО:DARS 04.02.2020
	//
	////++ ФТО:SEOS 08.05.2020 38729
	//ЗадатьРеквизитыНастройки(ПВХ.СтатьяДляОтраженияИзлишковТоваровМежфилиальныхПеремещений, Истина, "",, НСтр("ru = 'Статья, по которой документ ""Ордер на поступление товаров"" будет отражать поступление товаров на склад по результатам приемки межфилиального перемещения'"));
	////-- ФТО:SEOS 08.05.2020
	//
	////++ ФТО:SEOS 19.05.2020 38892
	//// Удален из предопределенных элементов
	//// ЗадатьРеквизитыНастройки(ПВХ.СегментыПоСрокамГодности, 		Истина, Справочники.СегментыНоменклатуры.ПустаяСсылка(),, НСтр("ru = 'Используется для определения ответственных логистов в документе ""Заказ на перемещение""'"));
	////-- ФТО:SEOS 19.05.2020	
	////-- ФТО:SOAL 19.11.2019
	//
	////++ ФТО:DARS 02.07.2020 31430
	//ЗадатьРеквизитыНастройки(ПВХ.ВидНесоответствияПересортица, Истина, Справочники.МВ_ВидыНесоответствий.ПустаяСсылка(),, НСтр("ru = 'Вид несоответствия, который указывается в документе ""Факт приемки для перемещения"" в табличной части ""Товары"".'"));
	////-- ФТО:DARS 02.07.2020	
	//#КонецОбласти
	//	
	//#Область НастройкиИнтеграцииС_EPS
	////++ ФТО:DANC 18.03.2020 37071
	//ЗадатьРеквизитыНастройки(ПВХ.EPS_Сервер, Истина, "", 10, НСтр("ru = 'Адрес сервера'"));
	//ЗадатьРеквизитыНастройки(ПВХ.EPS_База, Истина, "", 20, НСтр("ru = 'Имя базы'"));
	//ЗадатьРеквизитыНастройки(ПВХ.EPS_ПрефиксБазы, Истина, "", 30, НСтр("ru = 'Префикс базы'"));
	//ЗадатьРеквизитыНастройки(ПВХ.EPS_Пользователь, Истина, "", 40, НСтр("ru = 'Имя пользователя для подключения к базе'"));
	//ЗадатьРеквизитыНастройки(ПВХ.EPS_Пароль, Истина, "", 50, НСтр("ru = 'Пароль пользователя для подключения к базе'"));
	////-- ФТО:DANC 18.03.2020
	//
	////++ МВ:Лазарев 23.10.2020 44892
	//ЗадатьРеквизитыНастройки(ПВХ.EPS_КаталогЛогов, Истина, "", 60, НСтр("ru = 'Каталог для хранения логов обмена'"));
	////-- МВ:Лазарев 23.10.2020
	//#КонецОбласти
	//
	//#Область НастройкиЗагрузкиИзТиС77
	////++ МВ:Овчинников 26.11.2020 45565
	//ЗадатьРеквизитыНастройки(ПВХ.ТиС77ПутьБазы	  , Ложь, "", 10, НСтр("ru = 'Путь к базе данных 1С:7.7, к которой осуществляется подключение'"));
	//ЗадатьРеквизитыНастройки(ПВХ.ТиС77Пользователь, Ложь, "", 20, НСтр("ru = 'Имя пользователя для подключения к базе 1С:7.7'"));
	//ЗадатьРеквизитыНастройки(ПВХ.ТиС77Пароль	  , Ложь, "", 30, НСтр("ru = 'Пароль пользователя для подключения к базе'"));
	////-- МВ:Овчинников 26.11.2020
	//#КонецОбласти

	//#Область НастройкиОбменаСЧикаго
	////++ ФТО:ALNA 15.10.2019 32608
	//ЗадатьРеквизитыНастройки(ПВХ.ЧикагоКаталогВыгрузкиОбмена, Ложь, "");
	////-- ФТО:ALNA 15.10.2019
	//
	////++ ФТО:ALNA 27.01.2021 45561
	//ЗадатьРеквизитыНастройки(ПВХ.ИсполнительЗадачЧикаго, Ложь, Неопределено);
	////-- ФТО:ALNA 27.01.2021
	//#КонецОбласти
	//
	//#Область НастройкиОбменаС1СУПП
	////++ ФТО:YLYA 28.02.2020 36485
	//ЗадатьРеквизитыНастройки(ПВХ.КаталогОбмена, Истина, "",, НСтр("ru = 'Корневой каталог обмена данными 1С:УТ – 1С:УПП'"));
	////-- ФТО:YLYA 28.02.2020 
	//
	////++ ФТО:YLYA 24.03.2020 36485
	//ЗадатьРеквизитыНастройки(ПВХ.ОсновнойГрузополучатель, Ложь, Справочники.Партнеры.ПустаяСсылка(),, НСтр("ru = 'Этот грузополучатель, используется для заполнения одноименного реквизита в базе УПП'"));
	////-- ФТО:YLYA 24.03.2020 
	//
	////++ ФТО:KRAV 01.09.2020 42851
	//ЗадатьРеквизитыНастройки(ПВХ.АдресБазыУПП_МКВ		  , Истина, "", 10, НСтр("ru = 'База данных УПП МКВ, к которой осуществляется подключение'"));
	//ЗадатьРеквизитыНастройки(ПВХ.АдресБазыУПП_Молвест	  , Истина, "", 20, НСтр("ru = 'База данных УПП Молвест, к которой осуществляется подключение'"));
	//ЗадатьРеквизитыНастройки(ПВХ.ПользовательДляОбменаСУПП, Истина, "", 30, НСтр("ru = 'Имя пользователя для подключения к базе 1С:УПП'"));
	//ЗадатьРеквизитыНастройки(ПВХ.ПарольДляОбменаСУПП	  , Истина, "", 40, НСтр("ru = 'Пароль пользователя для подключения к базе'"));
	////-- ФТО:KRAV 01.09.2020
	//
	////++ ФТО:ALNA 18.09.2020 43685
	//ЗадатьРеквизитыНастройки(ПВХ.ОрганизацияПроизводственнойБазы, Ложь, Справочники.Организации.ПустаяСсылка());	
	//ЗадатьРеквизитыНастройки(ПВХ.КодДоговораПроизводственнойБазы, Ложь, "");
	//ЗадатьРеквизитыНастройки(ПВХ.КодКонтрагентаПроизводственнойБазы, Ложь, "");
	//ЗадатьРеквизитыНастройки(ПВХ.КодСкладаПроизводственнойБазы, Ложь, "");
	////-- ФТО:ALNA 18.09.2020
	//
	////++ ФТО:KRAV 16.10.2020 44699
	////++ ФТО:DARS 20.10.2020 44699
	////ЗадатьРеквизитыНастройки(ПВХ.ЦентральнаяКасса, Ложь, "",, НСтр("ru = 'Центральная касса для получения наличных из кассы выписки, используется для получения кода в выгрузке РКО'"));	
	//ЗадатьРеквизитыНастройки(ПВХ.ЦентральнаяКасса, Ложь, Справочники.Кассы.ПустаяСсылка(),, НСтр("ru = 'Центральная касса для получения наличных из кассы выписки, используется для получения кода в выгрузке РКО'"));	
	////-- ФТО:DARS 20.10.2020
	////-- ФТО:KRAV 16.10.2020
	//
	////++ ФТО:DARS 19.11.2020 45607
	//ЗадатьРеквизитыНастройки(ПВХ.СегментПродукцииСтерилизованногоМолока, Ложь, Справочники.СегментыНоменклатуры.ПустаяСсылка(),, НСтр("ru = 'Для определения перечня продукции из стерилизованного молока в правиле D16'"));	
	//ЗадатьРеквизитыНастройки(ПВХ.СкладСтерилизованногоМолока, Ложь, Справочники.Склады.ПустаяСсылка(),, НСтр("ru = 'Для определения склада стерилизованного молока в правиле D16'"));
	////-- ФТО:DARS 19.11.2020
	//
	////++ ФТО:DARS 01.12.2020 45926
	//ЗадатьРеквизитыНастройки(ПВХ.КодСкладаБракаПроизводственнойБазы, Ложь, "");
	////-- ФТО:DARS 01.12.2020
	//
	////++ ФТО:DARS 10.12.2020 46107 
	//ЗадатьРеквизитыНастройки(ПВХ.КодДоговораПоТареПроизводственнойБазы, Ложь, "");
	//ЗадатьРеквизитыНастройки(ПВХ.КодСкладаВыбытияТарыПроизводственнойБазы, Ложь, "",, НСтр("ru = 'Код склада выбытия тары для выгрузки ""Приобретения товаров и услуг""  по таре в правиле D05'"));
	////-- ФТО:DARS 10.12.2020
	//
	////++ ФТО:DARS 15.12.2020 46193
	//ЗадатьРеквизитыНастройки(ПВХ.КодПодразделенияСкладаГотовойПродукцииПроизводственнойБазы, Ложь, "",, НСтр("ru = 'Код подразделения производственной базы для списания по возврату поставщику в правиле D28'"));
	////-- ФТО:DARS 15.12.2020
	//
	////++ ФТО:DARS 28.01.2021 47028
	//ЗадатьРеквизитыНастройки(ПВХ.КаталогЗагрузкиПоступленияДенежныхСредств, Истина, "");
	////-- ФТО:DARS 28.01.2021
	//#КонецОбласти
	//
	//#Область НастройкиОбменаСSolvo
	////++ ФТО:ALNA 15.08.2019 31209
	//ЗадатьРеквизитыНастройки(ПВХ.СолвоDSN, Истина, "",, НСтр("ru = 'DSN шлюза Solvo'"));
	////++ ФТО:KOLT 08.06.2020 38802 Настройка удалена
	////ЗадатьРеквизитыНастройки(ПВХ.СолвоБазаДанных, Истина, "",, НСтр("ru = 'База данных, к которой осуществляется подключение'"));
	////-- ФТО:KOLT 08.06.2020 
	//ЗадатьРеквизитыНастройки(ПВХ.СолвоКаталогАрхива, Истина, "",, НСтр("ru = 'В данный каталог автоматически сохраняются все исходящие и входящие сообщения'"));
	//ЗадатьРеквизитыНастройки(ПВХ.СолвоКаталогЗагрузки, Истина, "",, НСтр("ru = 'Каталог для загрузки сообщений поступающих из шлюза Solvo. Для повторной загрузки сообщения достаточно скопировать необходимый файл из каталога архива.'"));
	//ЗадатьРеквизитыНастройки(ПВХ.СолвоПользователь, Истина, "", 10, НСтр("ru = 'Пользователь, используется для подключения к шлюзу'"));
	//ЗадатьРеквизитыНастройки(ПВХ.СолвоПароль, Истина, "", 20, НСтр("ru = 'Пароль, используется для подключения к шлюзу'"));
	//ЗадатьРеквизитыНастройки(ПВХ.СолвоСкладХраненияСтерилизованногоМолока, Истина, Справочники.Склады.ПустаяСсылка(),, НСтр("ru = 'Указывается текущий склад хранения стерилизованного молока'"));
	//ЗадатьРеквизитыНастройки(ПВХ.СолвоИспользоватьВнешнююОбработку, Истина, Ложь, 30, НСтр("ru = 'Возможность использования внешней обработки, без изменения конфигурации'"));
	//ЗадатьРеквизитыНастройки(ПВХ.СолвоВнешняяОбработка, Истина, Справочники.ДополнительныеОтчетыИОбработки.ПустаяСсылка(), 40, НСтр("ru = 'Указывается необходимая внешняя обработка'"));
	////-- ФТО:ALNA 15.08.2019
	//
	////++ ФТО:SOAL 05.11.2019 31209 
	//ЗадатьРеквизитыНастройки(ПВХ.СолвоАвтоматическаяОбработкаЗаданийНаПодбор, Истина, Ложь,, НСтр("ru = 'Включение автоматического подбора серий при формировании документа ""(МВ) Задание на подбор""'"));	
	//ЗадатьРеквизитыНастройки(ПВХ.СолвоСкладОптовойТорговлиШт1, Истина, Справочники.Склады.ПустаяСсылка(),, НСтр("ru = 'Склад для хранения неполных коробов L1'"));
	//ЗадатьРеквизитыНастройки(ПВХ.СолвоСкладОптовойТорговлиШт2, Истина, Справочники.Склады.ПустаяСсылка(),, НСтр("ru = 'Склад для хранения неполных коробов L2'"));
	//ЗадатьРеквизитыНастройки(ПВХ.СолвоСкладОптовойТорговлиШт3, Истина, Справочники.Склады.ПустаяСсылка(),, НСтр("ru = 'Склад для хранения неполных коробов L3 (дегустация)'"));
	//ЗадатьРеквизитыНастройки(ПВХ.СолвоСкладБракаООП, Истина, Справочники.Склады.ПустаяСсылка(),, НСтр("ru = 'Склад оптовых продаж для хранения брака'"));
	//ЗадатьРеквизитыНастройки(ПВХ.СолвоЦехМоцарелла, Истина, Справочники.Производители.ПустаяСсылка(),, НСтр("ru = 'Цех Моцарелла'"));	
	////-- ФТО:SOAL 05.11.2019
	//
	////++ ФТО:KOLT 06.10.2020 44214
	//////++ ФТО:KOLT 02.09.2020 42892
	////ЗадатьРеквизитыНастройки(ПВХ.СолвоПользовательУТДляЗагрузки, Истина, Справочники.Пользователи.ПустаяСсылка(),, НСтр("ru = 'Пользователь, для которого устанавливается дата загрузки документов из Solvo'"));	
	//////-- ФТО:KOLT 02.09.2020
	////-- ФТО:KOLT 06.10.2020
	//	
	//#КонецОбласти

	//#Область ОтделТехническогоКонтроля
	////++ ФТО:DARS 08.02.2020 33350
	//ЗадатьРеквизитыНастройки(ПВХ.ПричинаСписанияТечьПродукции, Истина, ПланыВидовХарактеристик.СтатьиРасходов.ПустаяСсылка(),, НСтр("ru = 'Для автоматического заполнения причины списания в обработке ""(МВ) Сводный акт ОТК""'"));
	////++ ФТО:DARS 26.05.2020 35903
	////ЗадатьРеквизитыНастройки(ПВХ.ТечьМолочныйДомик, Истина, Справочники.МВ_СпособыДальнейшегоИспользования.ПустаяСсылка(),, НСтр("ru = 'По указанному способу дальнейшего использования товаров отбираются данные для заполнения колонки ""Молочный Домик ООО"" в печатной форме ""Сводный акт ОТК""'"));
	////ЗадатьРеквизитыНастройки(ПВХ.ТечьМагазины, Истина, Справочники.МВ_СпособыДальнейшегоИспользования.ПустаяСсылка(),, НСтр("ru = 'По указанному способу дальнейшего использования товаров отбираются данные для заполнения колонки ""Магазины"" в печатной форме ""Сводный акт ОТК""'"));
	////ЗадатьРеквизитыНастройки(ПВХ.ТечьВТ_МКВ, Истина, Справочники.МВ_СпособыДальнейшегоИспользования.ПустаяСсылка(),, НСтр("ru = 'По указанному способу дальнейшего использования товаров отбираются данные для заполнения колонки ""ВТ МКВ"" в печатной форме ""Сводный акт ОТК""'"));	
	////-- ФТО:DARS 26.05.2020
	////-- ФТО:DARS 08.02.2020
	//
	////++ ФТО:DARS 16.06.2020 40178
	//ЗадатьРеквизитыНастройки(ПВХ.СтатьяДоходовОТК, Истина, ПланыВидовХарактеристик.СтатьиДоходов.ПустаяСсылка(),, НСтр("ru = 'Для автоматической подстановки статьи доходов в документ ""Ордер на поступление товаров"", оформленный на основании акта ОТК в случае пересортицы'"));
	//ЗадатьРеквизитыНастройки(ПВХ.СтатьяРасходовОТК, Истина, ПланыВидовХарактеристик.СтатьиРасходов.ПустаяСсылка(),, НСтр("ru = 'Для автоматической подстановки статьи доходов в документ ""Ордер на списание товаров"", оформленный на основании акта ОТК в случае пересортицы'"));
	////-- ФТО:DARS 16.06.2020
	//
	////++ ФТО:YLYA 22.06.2020 39280
	//ЗадатьРеквизитыНастройки(ПВХ.Промпереработка, Истина, Справочники.МВ_СпособыДальнейшегоИспользования.ПустаяСсылка(),, НСтр("ru = 'По данному дефекту производится суммирование суммы в ПФ ""МВ Акт ОТК"" для заполнения реквизита ""Промпереработка""'"));
	//ЗадатьРеквизитыНастройки(ПВХ.Утилизация, Истина, Справочники.МВ_СпособыДальнейшегоИспользования.ПустаяСсылка(),, НСтр("ru = 'По данному дефекту производится суммирование суммы в ПФ ""МВ Акт ОТК"" для заполнения реквизита ""Утилизация""'"));
	////-- ФТО:YLYA 22.06.2020 
	//#КонецОбласти
	//		
	//#Область ПараметрыПогрузки
	////++ ФТО:DARS 23.04.2020 38300
	//ЗадатьРеквизитыНастройки(ПВХ.ВеличинаШагаПогрузкиВЧасах, Истина, 0,, НСтр("ru = 'Плановое количество часов погрузки транспортного средства'"));
	////-- ФТО:DARS 23.04.2020
	//#КонецОбласти
	//
	//#Область ПеремещенияВПредставительства
	////++ ФТО:DARS 02.04.2020 37667
	//ЗадатьРеквизитыНастройки(ПВХ.Филиалы_FTP_Сервер, Ложь, "", 10, НСтр("ru = 'Сервер FTP для выгрузки в представительства'"));
	//ЗадатьРеквизитыНастройки(ПВХ.Филиалы_FTP_Порт, Ложь, 0, 20, НСтр("ru = 'Порт FTP для выгрузки в представительства'"));
	//ЗадатьРеквизитыНастройки(ПВХ.Филиалы_FTP_КаталогДляВыгрузки, Ложь, "", 30, НСтр("ru = 'Каталог FTP для выгрузки в представительства'"));
	//ЗадатьРеквизитыНастройки(ПВХ.Филиалы_FTP_Логин, Ложь, "", 40, НСтр("ru = 'Логин FTP для выгрузки в представительства'"));
	//ЗадатьРеквизитыНастройки(ПВХ.Филиалы_FTP_Пароль, Ложь, "", 50, НСтр("ru = 'Пароль FTP для выгрузки в представительства'"));
	////-- ФТО:DARS 02.04.2020
	//#КонецОбласти
	//	
	//#Область ПоступлениеТоваров
	////++ ФТО:DARS 04.09.2019 31662
	//ЗадатьРеквизитыНастройки(ПВХ.КаталогСпецификаций, Истина, "");
	//ЗадатьРеквизитыНастройки(ПВХ.ОптовыйСклад, Истина, Справочники.Склады.ПустаяСсылка());
	//ЗадатьРеквизитыНастройки(ПВХ.ПроизводительВесовыхСыров, Истина, Справочники.Производители.ПустаяСсылка());
	////-- ФТО:DARS 04.09.2019	
	//
	////++ ФТО:SOAL 04.03.2020 36611
	//ЗадатьРеквизитыНастройки(ПВХ.ИспользоватьПроизводственныеПлощадки, Ложь, Ложь,, НСтр("ru = 'Определяет возможность указания производственной площадки в заказах поставщику и приходных ордерах'"));	
	////-- ФТО:SOAL 04.03.2020 
	//#КонецОбласти
	//	
	//#Область Продажи
	////++ ФТО:KOLT 09.10.2019 32652
	//ЗадатьРеквизитыНастройки(ПВХ.СкладОбеспеченияДляТранзита, Истина, Справочники.Склады.ПустаяСсылка());	
	////-- ФТО:KOLT 09.10.2019 
	//
	////++ ФТО:YLYA 07.10.2019 32311
	//ЗадатьРеквизитыНастройки(ПВХ.ГруппаСегментовБюджетноСоциальнойСферы, Истина, Справочники.СегментыПартнеров.ПустаяСсылка(),, НСтр("ru = 'Сегменты клиентов, находящиеся в данной группе, относятся к бюджетно-социальной сфере и предполагают работу по контрактам'"));
	////-- ФТО:YLYA 07.10.2019
	//
	////++ ФТО:ALNA 02.12.2019 34040
	//ЗадатьРеквизитыНастройки(ПВХ.ВремяОкончанияПриемаЗаказов, Истина, ПустаяДата,, НСтр("ru = 'Заказ клиента, поступивший после указанного времени, не может быть отгружен на следующий день. Данные такого заказа при необходимости копируются для переноса на следующий день, исходный заказ закрывается с указанием причины отмены заказа.'"));
	//ЗадатьРеквизитыНастройки(ПВХ.ГруппаСегментовПартнеровПоМатрицамНоменклатуры, Истина, Справочники.СегментыПартнеров.ПустаяСсылка(),, НСтр("ru = 'Используется в документе ""МВ Матрица клиентов"" и для подбора номенклатуры по матрице клиента в документе ""Заказ клиента"".'"));
	//ЗадатьРеквизитыНастройки(ПВХ.МинимальныйПриоритетКлиентаДляЗначенияВысокий, Истина, 0,, НСтр("ru = 'Если указанный в соглашении с клиентом приоритет превышает это значение, то в документе ""Заказ клиента"" приоритет классифицируется как ""Высокий"".'"));
	//ЗадатьРеквизитыНастройки(ПВХ.МинимальныйПриоритетКлиентаДляЗначенияСредний, Истина, 0,, НСтр("ru = 'Если указанный в соглашении с клиентом приоритет превышает это значение, но не превышает минимальный приоритет клиента для значения ""Высокий"", то в документе ""Заказ клиента"" приоритет классифицируется как ""Средний"".'"));
	//ЗадатьРеквизитыНастройки(ПВХ.ПричинаОтменыЗаказаПриНесоблюденииСроковПодачи, Истина, Справочники.ПричиныОтменыЗаказовКлиентов.ПустаяСсылка(),, НСтр("ru = 'Эта причина отмены заказа будет использоваться при поступлении заказа клиента после времени окончания приема заказов, если пользователь решит перенести заказ на следующий день.'"));
	//ЗадатьРеквизитыНастройки(ПВХ.ПричинаОтменыЗаказаПриОтказеКлиента, Истина, Справочники.ПричиныОтменыЗаказовКлиентов.ПустаяСсылка(),, НСтр("ru = 'Эта причина отмены заказа будет использоваться для всего заказа или отдельных его строк, когда клиент полностью отказывается от ранее заказанного товара.'"));
	//ЗадатьРеквизитыНастройки(ПВХ.СрокПоставкиТоваров, Истина, 0,, НСтр("ru = 'Количество дней после получения заказа клиента, не позднее которого необходимо осуществить отгрузку. Используется для подстановки в соглашение с клиентом.'"));
	////-- ФТО:ALNA 02.12.2019
	//
	////++ ФТО:ALNA 26.12.2019 34055
	//ЗадатьРеквизитыНастройки(ПВХ.ПричинаОтменыЗаказаПриОтсутствииТовараВНаличии, Истина, Справочники.ПричиныОтменыЗаказовКлиентов.ПустаяСсылка(),, НСтр("ru = 'Эта причина отмены заказа будет использоваться для всего заказа или его отдельных строк при отсутствии товара в наличии'"));
	////-- ФТО:ALNA 26.12.2019
	//
	////++ ФТО:ALNA 05.03.2020 36663
	//ЗадатьРеквизитыНастройки(ПВХ.ПричинаОтменыЗаказаПриОкругленииПоУпаковке, Истина, Справочники.ПричиныОтменыЗаказовКлиентов.ПустаяСсылка(),, НСтр("ru = 'Эта причина отмены заказа будет использоваться для его отдельных строк при заказе количества товаров, не соответствующего вложенности упаковки'"));
	////-- ФТО:ALNA 05.03.2020
	//
	////++ ФТО:GUTA 11.03.2020 36875
	//ЗадатьРеквизитыНастройки(ПВХ.ПричинаОтменыЗаказаПриЗаказеТоваровЗапрещенныхКОтгрузке, Истина, Справочники.ПричиныОтменыЗаказовКлиентов.ПустаяСсылка(),, НСтр("ru = 'Эта причина отмены заказа будет использоваться для всего заказа или его отдельных строк при заказе товаров, запрещенных к отгрузке в справочнике ""(МВ) Матрицы EDI""'"));
	////-- ФТО:GUTA 11.03.2020
	//
	////++ ФТО:YUSI 18.05.2020 36399
	//ЗадатьРеквизитыНастройки(ПВХ.УсловияПоставки, Истина, "",, НСтр("ru = 'Условия поставки'"));
	////-- ФТО:YUSI 18.05.2020
	//#КонецОбласти
	//	
	//#Область РаботаСОператоромБелгород
	////++ ФТО:STAS 06.11.2019 33453
	//ЗадатьРеквизитыНастройки(ПВХ.БелгородИспользоватьВыгрузку,	Ложь, Ложь, 10, НСтр("ru = 'Возможность осуществлять выгрузку файлов для логистического оператора (г. Белгород).'"));
	////++ МВ:Увин 26.06.2020 33473
	////ЗадатьРеквизитыНастройки(ПВХ.БелгородСклад,					Ложь, Справочники.Склады.ПустаяСсылка(), 20, НСтр("ru = 'Склад логистического оператора.'"));
	////ЗадатьРеквизитыНастройки(ПВХ.БелгородАдресСервера,			Ложь, "", 30, НСтр("ru = 'Адрес сервера логистического оператора (для выгрузки файлов на сервер).'"));
	////ЗадатьРеквизитыНастройки(ПВХ.БелгородИмяПользователя,		Ложь, "", 40, НСтр("ru = 'Имя пользователя (логин) для авторизации на сервере.'"));
	////ЗадатьРеквизитыНастройки(ПВХ.БелгородПароль,				Ложь, "", 50, НСтр("ru = 'Пароль пользователя для авторизации на сервере.'"));
	////ЗадатьРеквизитыНастройки(ПВХ.БелгородАдресЭлектроннойПочты,	Ложь, "", 60, НСтр("ru = 'Адрес электронной почты (для отправки файлов по электронной почте).'"));
	////-- МВ:Увин 26.06.2020 33473
	////-- ФТО:STAS 06.11.2019
	//#КонецОбласти
	//
	//#Область РаботаСОператоромДиалог
	////++ ФТО:STAS 06.11.2019 33453
	//ЗадатьРеквизитыНастройки(ПВХ.ДиалогИспользоватьВыгрузку,	Ложь, Ложь, 10, НСтр("ru = 'Возможность осуществлять выгрузку файлов для логистического оператора (г. Санкт-Петербург).'"));
	////++ МВ:Увин 26.06.2020 33473
	////ЗадатьРеквизитыНастройки(ПВХ.ДиалогСклад,					Ложь, Справочники.Склады.ПустаяСсылка(), 20, НСтр("ru = 'Склад логистического оператора.'"));
	////ЗадатьРеквизитыНастройки(ПВХ.ДиалогАдресСервера,			Ложь, "", 30, НСтр("ru = 'Адрес сервера логистического оператора (для выгрузки файлов на сервер).'"));
	////ЗадатьРеквизитыНастройки(ПВХ.ДиалогИмяПользователя,			Ложь, "", 40, НСтр("ru = 'Имя пользователя (логин) для авторизации на сервере.'"));
	////ЗадатьРеквизитыНастройки(ПВХ.ДиалогПароль,					Ложь, "", 50, НСтр("ru = 'Пароль пользователя для авторизации на сервере.'"));
	////ЗадатьРеквизитыНастройки(ПВХ.ДиалогАдресЭлектроннойПочты,	Ложь, "", 60, НСтр("ru = 'Адрес электронной почты (для отправки файлов по электронной почте).'"));
	////-- МВ:Увин 26.06.2020 33473
	////-- ФТО:STAS 06.11.2019
	//#КонецОбласти
	//
	//#Область РаботаСОператоромСтарыйОскол
	////++ ФТО:STAS 06.11.2019 33453
	//ЗадатьРеквизитыНастройки(ПВХ.СтарыйОсколИспользоватьВыгрузку,	Ложь, Ложь, 10, НСтр("ru = 'Возможность осуществлять выгрузку файлов для логистического оператора (г. Старый Оскол).'"));
	//ЗадатьРеквизитыНастройки(ПВХ.СтарыйОсколСклад,					Ложь, Справочники.Склады.ПустаяСсылка(), 20, НСтр("ru = 'Склад логистического оператора.'"));
	//ЗадатьРеквизитыНастройки(ПВХ.СтарыйОсколАдресСервера,			Ложь, "", 30, НСтр("ru = 'Адрес сервера логистического оператора (для выгрузки файлов на сервер).'"));
	//ЗадатьРеквизитыНастройки(ПВХ.СтарыйОсколИмяПользователя,		Ложь, "", 40, НСтр("ru = 'Имя пользователя (логин) для авторизации на сервере.'"));
	//ЗадатьРеквизитыНастройки(ПВХ.СтарыйОсколПароль,					Ложь, "", 50, НСтр("ru = 'Пароль пользователя для авторизации на сервере.'"));
	//ЗадатьРеквизитыНастройки(ПВХ.СтарыйОсколАдресЭлектроннойПочты,	Ложь, "", 60, НСтр("ru = 'Адрес электронной почты (для отправки файлов по электронной почте).'"));
	////-- ФТО:STAS 06.11.2019
	//#КонецОбласти
	//
	//#Область РаботаСОператоромТамбов
	////++ ФТО:STAS 06.11.2019 33453
	//ЗадатьРеквизитыНастройки(ПВХ.ТамбовИспользоватьВыгрузку,	Ложь, Ложь, 10, НСтр("ru = 'Возможность осуществлять выгрузку файлов для логистического оператора (г. Тамбов).'"));
	////++ МВ:Увин 26.06.2020 33473
	////ЗадатьРеквизитыНастройки(ПВХ.ТамбовСклад,					Ложь, Справочники.Склады.ПустаяСсылка(), 20, НСтр("ru = 'Склад логистического оператора.'"));
	////ЗадатьРеквизитыНастройки(ПВХ.ТамбовАдресСервера,			Ложь, "", 30, НСтр("ru = 'Адрес сервера логистического оператора (для выгрузки файлов на сервер).'"));
	////ЗадатьРеквизитыНастройки(ПВХ.ТамбовИмяПользователя,			Ложь, "", 40, НСтр("ru = 'Имя пользователя (логин) для авторизации на сервере.'"));
	////ЗадатьРеквизитыНастройки(ПВХ.ТамбовПароль,					Ложь, "", 50, НСтр("ru = 'Пароль пользователя для авторизации на сервере.'"));
	////ЗадатьРеквизитыНастройки(ПВХ.ТамбовАдресЭлектроннойПочты,	Ложь, "", 60, НСтр("ru = 'Адрес электронной почты (для отправки файлов по электронной почте).'"));
	////-- МВ:Увин 26.06.2020 33473
	////-- ФТО:STAS 06.11.2019
	//#КонецОбласти
	//
	//#Область Склад
	////++ ФТО:KOLT 07.11.2019 33267
	//ЗадатьРеквизитыНастройки(ПВХ.ОптоваяБазоваяЦена, 				 Ложь, Справочники.ВидыЦен.ПустаяСсылка(), 	10, НСтр("ru = 'Цена, которая используется в печатных формах перемещений'"));
	////++ ФТО:ALNA 25.01.2020 33352
	////ЗадатьРеквизитыНастройки(ПВХ.ВремяСменыОтветственныхЛицНаСкладе, Ложь, '0001.01.01',					 	20, НСтр("ru = 'Для автоматической подстановки времени в обработку ""(МВ) Ввод кладовщиков"".'"));
	//ЗадатьРеквизитыНастройки(ПВХ.ВремяСменыОтветственныхЛицНаСкладе, Истина, ПустаяДата,					 	20, НСтр("ru = 'Для автоматической подстановки времени в обработку ""(МВ) Ввод кладовщиков"".'"));
	////-- ФТО:ALNA 25.01.2020	
	////-- ФТО:KOLT 07.11.2019 
	//
	////++ ФТО:SOAL 07.02.2020 35733
	////++ ФТО:DARS 18.05.2020 39132
	////ЗадатьРеквизитыНастройки(ПВХ.СкладОТК, Истина, Справочники.Склады.ПустаяСсылка(), 20, НСтр("ru = 'Если данный склад будет указан, как склад-получатель в документе ""Перемещение товаров"", то при проведении документа будут сформированы движения в регистр накопления ""Акты ОТК к оформлению""'"));
	//ЗадатьРеквизитыНастройки(ПВХ.СкладыБрака, Истина, Справочники.Склады.ПустаяСсылка(), 20, НСтр("ru = 'Если склад из данной группы будет указан, как склад-получатель в документе ""Перемещение товаров"", то при проведении документа будут сформированы движения в регистр накопления ""Акты ОТК к оформлению""'"));
	////-- ФТО:DARS 18.05.2020
	////-- ФТО:SOAL 07.02.2020 
	//
	////++ ФТО:SEOS 25.08.2020 41726
	//ЗадатьРеквизитыНастройки(ПВХ.УчетнаяЦенаДляОприходованияИСписанияТоваров, Ложь, Справочники.ВидыЦен.ПустаяСсылка(),, НСтр("ru = 'Вид цен, устанавливаемый по умолчанию в документ ""Оприходование излишков товаров"" и ""Списание недостач товаров""'"));
	////-- ФТО:SEOS 25.08.2020
	//
	////++ ФТО:DARS 04.02.2021 46306
	//ЗадатьРеквизитыНастройки(ПВХ.КорректировкаПриходаДоВыяснения, Истина, ПланыВидовХарактеристик.СтатьиРасходов.ПустаяСсылка(),, НСтр("ru = 'Статья расходов для подстановки в документы по умолчанию'"));
	////-- ФТО:DARS 04.02.2021
	//#КонецОбласти
	//
	//#Область СкладыСНесколькимиТочкамиОтгрузки
	////++ ФТО:DARS 11.12.2019 34314  
	//ЗадатьРеквизитыНастройки(ПВХ.СкладСНесколькимиТочкамиОтгрузки, Истина, Справочники.Склады.ПустаяСсылка());
	////-- ФТО:DARS 11.12.2019
	//#КонецОбласти
	//
	//#Область Тара
	////++ ФТО:SOAL 26.09.2019 32242
	//ЗадатьРеквизитыНастройки(ПВХ.ПоддонДеревянный, Истина, Справочники.Номенклатура.ПустаяСсылка());
	////-- ФТО:SOAL 26.09.2019 
	//
	////++ ФТО:KOSE 16.04.2021 48980 
	////++ ФТО:DARS 10.12.2020 46107
	////ЗадатьРеквизитыНастройки(ПВХ.ПоддонНеобработанныйДеревянный, Истина, Справочники.Номенклатура.ПустаяСсылка());
	////-- ФТО:DARS 10.12.2020
	//ЗадатьРеквизитыНастройки(ПВХ.ПоддонНеоборотныйДеревянный, Истина, Справочники.Номенклатура.ПустаяСсылка());
	////-- ФТО:KOSE 16.04.2021
	//#КонецОбласти
	//	
	//#Область ТранспортныеУслуги
	////++ ФТО:DARS 09.06.2020 39992
	//ЗадатьРеквизитыНастройки(ПВХ.ВремяНачалаТоргов,								Истина, ПустаяДата, 30, НСтр("ru = 'Время для подстановки в обработку выгрузки данных документа ""(МВ) Маршрутный лист"" (вкладка ""Тендер"") на сайт электронных торгов.'"));
	//ЗадатьРеквизитыНастройки(ПВХ.ВремяОкончанияТоргов,							Истина, ПустаяДата, 40, НСтр("ru = 'Время для подстановки в обработку выгрузки данных документа ""(МВ) Маршрутный лист"" (вкладка ""Тендер"") на сайт электронных торгов.'"));
	//ЗадатьРеквизитыНастройки(ПВХ.ЗаказчикТранспортныхУслуг,						Истина, Справочники.Организации.ПустаяСсылка(), 10, НСтр("ru = 'Организация, от имени которой выставляется стоимость транспортных услуг (в зависимости от принадлежности к ней перевозимого груза).'"));
	//ЗадатьРеквизитыНастройки(ПВХ.ИспользоватьРасстояниеОтСклада,				Истина, Ложь, 20, НСтр("ru = 'При установке данного признака расчет стоимости транспортных услуг осуществляется по расстоянию от склада.'"));
	//ЗадатьРеквизитыНастройки(ПВХ.ИспользоватьПризнакПеремещениеВОплатахРейса, 	Истина, Ложь, 50, НСтр("ru = 'При установке данного признака появляется возможность разграничить документы ""МВ Оплата рейса"" (розница) по признаку ""Перемещение"" (флаг устанавливается для межфилиальных перемещений).'"));
	//ЗадатьРеквизитыНастройки(ПВХ.ТипТочкиШкольноеПитание,						Истина, Справочники.МВ_ТипыТочек.ПустаяСсылка(), 60, НСтр("ru = 'Требуется для определения клиентов, относящихся к маршрутам со школьным молоком.'"));
	//ЗадатьРеквизитыНастройки(ПВХ.КодУПП_ПодразделенияЛогистикиОпт,	   Ложь, "", 70, НСтр("ru = 'Требуется для выгрузки данных документов ""МВ Оплата рейса"" (опт) в систему 1С:Управление производственным предприятием.'"));
	//ЗадатьРеквизитыНастройки(ПВХ.КодУПП_ПодразделенияЛогистикиРозница, Ложь, "", 80, НСтр("ru = 'Требуется для выгрузки данных документов ""МВ Оплата рейса"" (розница) в систему 1С:Управление производственным предприятием.'"));
	////-- ФТО:DARS 09.06.2020
	//
	////++ ФТО:LITA 07.08.2020 42356
	//ЗадатьРеквизитыНастройки(ПВХ.КодУПП_СтатьиЗатратОпт,	 Ложь, "", 90, НСтр("ru = 'Требуется для выгрузки данных документов ""МВ Оплата рейса"" (опт) в систему 1С:Управление производственным предприятием.'"));
	//ЗадатьРеквизитыНастройки(ПВХ.КодУПП_СтатьиЗатратРозница, Ложь, "", 100, НСтр("ru = 'Требуется для выгрузки данных документов ""МВ Оплата рейса"" (розница) в систему 1С:Управление производственным предприятием.'"));
	//ЗадатьРеквизитыНастройки(ПВХ.СчетЗатратПоТранспортнымУслугамОпт,	 Ложь, "", 110, НСтр("ru = 'Требуется для выгрузки данных документов ""МВ Оплата рейса"" (опт) в систему 1С:Управление производственным предприятием.'"));
	//ЗадатьРеквизитыНастройки(ПВХ.СчетЗатратПоТранспортнымУслугамРозница, Ложь, "", 120, НСтр("ru = 'Требуется для выгрузки данных документов ""МВ Оплата рейса"" (розница) в систему 1С:Управление производственным предприятием.'"));
	////-- ФТО:LITA 07.08.2020
	//#КонецОбласти
	//
	//#Область УчетПоКатегориямТоваров
	////++ ФТО:ALNA 23.08.2019 31369
	//ЗадатьРеквизитыНастройки(ПВХ.ИспользоватьКатегорииНоменклатурыПоСрокамГодности, Ложь, Ложь,, НСтр("ru = 'Возможность ведения взаиморасчетов с клиентами по категориям товаров, когда предоставляется отсрочка платежа в зависимости от срока годности товара.
	//																										|При использовании этой настройки необходимо указать группу сегментов номенклатуры по срокам годности.'"));	
	//ЗадатьРеквизитыНастройки(ПВХ.ГруппаСегментовНоменклатуры, Ложь, Справочники.СегментыНоменклатуры.ПустаяСсылка(),, НСтр("ru = 'Группа сегментов номенклатуры, в которую входят сегменты номенклатуры с разными сроками годности. Указывается, если применяется настройка ""Использовать категории номенклатуры по срокам годности"".'"));	
	////-- ФТО:ALNA 23.08.2019
	//#КонецОбласти
	//
	//#Область ФинансовыйКонтроль
	////++ ФТО:ALNA 23.08.2019 31369
	//ОписаниеДляWebСервиса = НСтр("ru = 'Используется для подключения к внешней БД при формировании печатной формы ""Контроль снятия блокировки"" документа ""(МВ) Управление блокировкой отгрузки"".
	//									|Для использования необходимо включить функциональную опцию ""(МВ) Использовать блокировку отгрузки"".'");
	//ЗадатьРеквизитыНастройки(ПВХ.АдресWebСервисаМВ_КонтрольДебиторскойЗадолженности, Ложь, "", 10, ОписаниеДляWebСервиса); 
	//ЗадатьРеквизитыНастройки(ПВХ.ПарольДляWebСервисаМВ_КонтрольДебиторскойЗадолженности, Ложь, "mo1ve5t_W3B_RC", 20, ОписаниеДляWebСервиса); // пароль, который задан при создании пользователя для веб-сервиса
	////-- ФТО:ALNA 23.08.2019
	//
	////++ ФТО:ALNA 07.05.2020 38357
	//ЗадатьРеквизитыНастройки(ПВХ.КомментарийДляСнятияБлокировки, Истина, "",, НСтр("ru = 'Используется для заполнения поля ""Комментарий"" в списке ""Задолженность"" документа ""(МВ) Управление блокировкой отгрузки"" с видом операции ""Снятие блокировки"", когда сумма просроченной задолженности равна 0'"));
	////-- ФТО:ALNA 07.05.2020
	//#КонецОбласти
	//
	//#Область Ценообразование
	////++ ФТО:YLYA 07.10.2019 32311
	//ЗадатьРеквизитыНастройки(ПВХ.БонусныеПродукты, Истина, Справочники.СегментыНоменклатуры.ПустаяСсылка(),, НСтр("ru = 'Сегмент номенклатуры, содержащий позиции, которые реализуются клиентам в рамках акции формата ""Х+У"" (подарок за покупку) как подарок'"));
	////-- ФТО:YLYA 07.10.2019
	//
	////++ ФТО:VETA 30.12.2019 34632
	////++ ФТО:ALNA 10.04.2020 34632
	////ЗадатьРеквизитыНастройки(ПВХ.ГруппаКатегорийСкидок, Истина, Справочники.ЦеновыеГруппы.ПустаяСсылка(),, НСтр("ru = 'По категориям скидок из этой группы можно задать коммерческие условия клиентов'"));
	//ЗадатьРеквизитыНастройки(ПВХ.ПрименятьОтклоненияОтСтандартногоЦенообразования, Истина, Ложь,, НСтр("ru = 'При установленном признаке будут применяться особенности ценообразования в организации: цена на дату заказа, конечная специальная цена клиента и т.д.'"));
	////-- ФТО:ALNA 10.04.2020
	//
	//ЗадатьРеквизитыНастройки(ПВХ.ТипСкидкиНаценкиЗаДоставку, Истина, Справочники.ДополнительныеОтчетыИОбработки.ПустаяСсылка(),, НСтр("ru = 'Тип скидки наценки за доставку'"));
	////-- ФТО:VETA 30.12.2019
	//
	////++ ФТО:ALNA 16.06.2020 34632
	//ЗадатьРеквизитыНастройки(ПВХ.ПериодХраненияИсторииПоСпециальнымЦенамПриДобавленииНовыхДанных, Истина, 0,, НСтр("ru = 'При добавлении информации об установленной специальной цене в соглашение клиента данные с датой окончания действия ""старше"" указанного количества месяцев - очищаются'"));
	////-- ФТО:ALNA 16.06.2020
	//
	////++ ФТО:YLYA 23.09.2020 43600
	//ЗадатьРеквизитыНастройки(ПВХ.ГруппаСегментовДляТрейдМаркетинга, Истина, Справочники.СегментыПартнеров.ПустаяСсылка(),, НСтр("ru = 'Сегменты клиентов, находящиеся в данной группе, используются трейд-маркетологами для оформления распоряжений об акции одновременно на группу клиентов'"));
	//-- ФТО:YLYA 23.09.2020 
	//#КонецОбласти

	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗадатьРеквизитыНастройки(Настройка, Общая, ЗначениеПоУмолчанию, Порядок = 0, Описание = "");
	 
	НастройкаОбъект = Настройка.ПолучитьОбъект();
	НастройкаОбъект.Заблокировать();
	НастройкаОбъект.Общая = Общая;
	НастройкаОбъект.ЗначениеПоУмолчанию = ЗначениеПоУмолчанию;
	НастройкаОбъект.Описание = Описание;
	НастройкаОбъект.Порядок = Порядок;
	НастройкаОбъект.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли


//++ ФТО:DARS 18.05.2020 39132
// Изменено имя настройки: Склад ОТК -> Склады брака
//-- ФТО:DARS 18.05.2020

//++ ФТО:SEOS 19.05.2020 38892
// Удален из предопределенных элементов: СегментыПоСрокамГодности
//-- ФТО:SEOS 19.05.2020

//++ ФТО:DARS 26.05.2020 35903
// Удалены предопределенные элементы: ТечьМолочныйДомик, ТечьМагазины, ТечьВТ_МКВ
//-- ФТО:DARS 26.05.2020

//++ ФТО:KOLT 03.06.2020 38802
// Удалены предопределенные элементы: СолвоБазаДанных
//-- ФТО:KOLT 03.06.2020 

//++ ФТО:DARS 09.06.2020 39992
//	Расширен тип значения характеристик: Справочник.МВ_ТипыТочек	
//-- ФТО:DARS 09.06.2020

//++ ФТО:KOLT 02.09.2020 42892
// Расширен тип значения характеристик: Справочник.Пользователи	
// Добавлен предопределенный элемент: СолвоПользовательУТДляЗагрузки 	
//-- ФТО:KOLT 02.09.2020 

//++ ФТО:YLYA 23.09.2020 43600
// Изменено имя папки "Ценообразование" на "Ценообразование и маркетинг"
//-- ФТО:YLYA 23.09.2020 

//++ ФТО:KOLT 06.10.2020 44214
// Удален предопределенный элемент: СолвоПользовательУТДляЗагрузки 	
//-- ФТО:KOLT 06.10.2020

//++ ФТО:KOSE 16.04.2021 48980 
// Изменено имя предопределенного элемента с "ПоддонНеобработанныйДеревянный" на "ПоддонНеоборотныйДеревянный" 
// и наименование с "Поддон необработанный деревянный" на "Поддон необоротный деревянный" 
//-- ФТО:KOSE 16.04.2021
